#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        cluster_subnet = "10.244.0.0/16"
        created_at     = "2020-03-15 07:58:25 +0000 UTC"
        endpoint       = "https://9329c2de-f4e2-4f80-be4c-16fefb26477e.k8s.ondigitalocean.com"
        id             = "9329c2de-f4e2-4f80-be4c-16fefb26477e"
        ipv4_address   = "138.197.199.67"
        kube_config    = (sensitive value)
        name           = "foreign-language-reader"
        region         = "sfo2"
        service_subnet = "10.245.0.0/16"
        status         = "running"
        tags           = [
            "prod",
        ]
        updated_at     = "2020-03-29 06:00:17 +0000 UTC"
        version        = "1.16.6-do.2"

      ~ node_pool {
            actual_node_count = 4
            auto_scale        = true
            id                = "526d45ba-e14f-437e-883e-54bcf648a21f"
            labels            = {}
          ~ max_nodes         = 5 -> 6
            min_nodes         = 1
            name              = "worker-pool"
            node_count        = 0
            nodes             = [
                {
                    created_at = "2020-03-21 22:17:49 +0000 UTC"
                    droplet_id = "185707694"
                    id         = "2ee566c0-2957-4e77-abb1-c5e9ddc8bfaa"
                    name       = "worker-pool-ztyu"
                    status     = "running"
                    updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
                {
                    created_at = "2020-03-21 22:17:49 +0000 UTC"
                    droplet_id = "185707693"
                    id         = "14dd9710-576e-4ee0-8964-4aa27ae062a8"
                    name       = "worker-pool-ztyc"
                    status     = "running"
                    updated_at = "2020-03-21 22:19:09 +0000 UTC"
                },
                {
                    created_at = "2020-03-21 22:25:29 +0000 UTC"
                    droplet_id = "185708224"
                    id         = "61f51359-a05f-4ee0-af3d-7369aed110f0"
                    name       = "worker-pool-ztxu"
                    status     = "running"
                    updated_at = "2020-03-21 22:26:50 +0000 UTC"
                },
                {
                    created_at = "2020-03-25 04:23:20 +0000 UTC"
                    droplet_id = "186082569"
                    id         = "b1564256-75fc-4833-b376-58264269a083"
                    name       = "worker-pool-z9lz"
                    status     = "running"
                    updated_at = "2020-03-25 04:24:39 +0000 UTC"
                },
            ]
            size              = "s-2vcpu-4gb"
            tags              = []
        }
    }

  # module.infrastructure.module.api.kubernetes_deployment.api will be updated in-place
  ~ resource "kubernetes_deployment" "api" {
        id = "default/api"

        metadata {
            annotations      = {}
            generation       = 9
            labels           = {}
            name             = "api"
            namespace        = "default"
            resource_version = "1994101"
            self_link        = "/apis/apps/v1/namespaces/default/deployments/api"
            uid              = "d3557d8b-e6b2-494e-91c5-41e2f52e9214"
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
          ~ replicas                  = 2 -> 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "api"
                }
            }

            strategy {
                type = "RollingUpdate"

                rolling_update {
                    max_surge       = "25%"
                    max_unavailable = "25%"
                }
            }

            template {
                metadata {
                    annotations = {}
                    generation  = 0
                    labels      = {
                        "app" = "api"
                    }
                }

                spec {
                    active_deadline_seconds          = 0
                    automount_service_account_token  = false
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                    node_selector                    = {}
                    restart_policy                   = "Always"
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                    container {
                        args                     = []
                        command                  = []
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:036b331135f52ff5d5dcee3dedaa71f0fcbeada6"
                        image_pull_policy        = "Always"
                        name                     = "api"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                        env {
                            name = "DATABASE_URL"

                            value_from {

                                secret_key_ref {
                                    key  = "connection_string"
                                    name = "api-database-credentials"
                                }
                            }
                        }
                        env {
                            name  = "LANGUAGE_SERVICE_URL"
                            value = "http://language-service.default.svc.cluster.local:8000"
                        }
                        env {
                            name = "SECRET_KEY_BASE"

                            value_from {

                                secret_key_ref {
                                    key  = "secret_key_base"
                                    name = "api-secret-key-base"
                                }
                            }
                        }

                        liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                        port {
                            container_port = 4000
                            host_port      = 0
                            protocol       = "TCP"
                        }

                        readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 60
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "4000"
                                scheme = "HTTP"
                            }
                        }

                        resources {
                            limits {
                                memory = "500Mi"
                            }

                            requests {
                                memory = "100Mi"
                            }
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }

                    init_container {
                        args                     = []
                        command                  = [
                            "bin/api",
                            "eval",
                            "'Api.Release.migrate'",
                        ]
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-api:latest"
                        image_pull_policy        = "Always"
                        name                     = "migrate-database"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "DATABASE_URL"

                            value_from {

                                secret_key_ref {
                                    key  = "connection_string"
                                    name = "api-database-credentials"
                                }
                            }
                        }
                        env {
                            name = "SECRET_KEY_BASE"

                            value_from {

                                secret_key_ref {
                                    key  = "secret_key_base"
                                    name = "api-secret-key-base"
                                }
                            }
                        }
                        env {
                            name  = "AUTH_TOKEN"
                            value = "none"
                        }
                        env {
                            name  = "LANGUAGE_SERVICE_URL"
                            value = "none"
                        }

                        resources {
                        }
                    }
                }
            }
        }
    }

  # module.infrastructure.module.language_service.kubernetes_deployment.language_service will be updated in-place
  ~ resource "kubernetes_deployment" "language_service" {
        id = "default/language-service"

        metadata {
            annotations      = {}
            generation       = 9
            labels           = {}
            name             = "language-service"
            namespace        = "default"
            resource_version = "1994904"
            self_link        = "/apis/apps/v1/namespaces/default/deployments/language-service"
            uid              = "cf632e09-4b8b-4a11-a3cc-f3796eba51d3"
        }

      ~ spec {
            min_ready_seconds         = 0
            paused                    = false
            progress_deadline_seconds = 600
          ~ replicas                  = 2 -> 1
            revision_history_limit    = 10

            selector {
                match_labels = {
                    "app" = "language-service"
                }
            }

            strategy {
                type = "RollingUpdate"

                rolling_update {
                    max_surge       = "25%"
                    max_unavailable = "25%"
                }
            }

            template {
                metadata {
                    annotations = {}
                    generation  = 0
                    labels      = {
                        "app" = "language-service"
                    }
                }

                spec {
                    active_deadline_seconds          = 0
                    automount_service_account_token  = false
                    dns_policy                       = "ClusterFirst"
                    host_ipc                         = false
                    host_network                     = false
                    host_pid                         = false
                    node_selector                    = {}
                    restart_policy                   = "Always"
                    share_process_namespace          = false
                    termination_grace_period_seconds = 30

                    container {
                        args                     = []
                        command                  = []
                        image                    = "037187302622.dkr.ecr.us-west-2.amazonaws.com/foreign-language-reader-language-service:036b331135f52ff5d5dcee3dedaa71f0fcbeada6"
                        image_pull_policy        = "IfNotPresent"
                        name                     = "language-service"
                        stdin                    = false
                        stdin_once               = false
                        termination_message_path = "/dev/termination-log"
                        tty                      = false

                        env {
                            name = "AUTH_TOKEN"

                            value_from {

                                secret_key_ref {
                                    key  = "local_connection_token"
                                    name = "local-connection-token"
                                }
                            }
                        }
                        env {
                            name  = "ELASTICSEARCH_URL"
                            value = "http://elasticsearch-master.default.svc.cluster.local:9200"
                        }
                        env {
                            name = "ELASTICSEARCH_USERNAME"

                            value_from {

                                secret_key_ref {
                                    key  = "username"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }
                        env {
                            name = "ELASTICSEARCH_PASSWORD"

                            value_from {

                                secret_key_ref {
                                    key  = "password"
                                    name = "language-service-elastic-credentials"
                                }
                            }
                        }

                        liveness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                        port {
                            container_port = 8000
                            host_port      = 0
                            protocol       = "TCP"
                        }

                        readiness_probe {
                            failure_threshold     = 5
                            initial_delay_seconds = 30
                            period_seconds        = 10
                            success_threshold     = 1
                            timeout_seconds       = 5

                            http_get {
                                path   = "/health"
                                port   = "8000"
                                scheme = "HTTP"
                            }
                        }

                        resources {
                            limits {
                                memory = "1288490188800m"
                            }

                            requests {
                                memory = "800Mi"
                            }
                        }
                    }

                    image_pull_secrets {
                        name = "aws-registry"
                    }
                }
            }
        }
    }

  # module.infrastructure.module.monitoring.helm_release.metrics_server will be created
  + resource "helm_release" "metrics_server" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "default"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-charts.storage.googleapis.com"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "2.10.1"
      + wait                       = true
    }

  # module.infrastructure.module.monitoring.kubernetes_namespace.monitoring will be created
  + resource "kubernetes_namespace" "monitoring" {
      + id = (known after apply)

      + metadata {
          + annotations      = {
              + "name" = "monitoring"
            }
          + generation       = (known after apply)
          + name             = "monitoring"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
